# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Q7. Create a DataFrame using multiple Series. Explain with an example

In [3]:
import pandas as pd

# # Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
data=[ 4, 8, 15, 16, 23, 42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
data=[ 4, 8, 15, 16, 23, 42,4, 8, 15, 16, 23, 42]
pd.Series(data)

0      4
1      8
2     15
3     16
4     23
5     42
6      4
7      8
8     15
9     16
10    23
11    42
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

# Name
Alice
Bob
Claire
Age
25
30
27

Gender

Female
Male
Female

In [15]:
dict_value={"name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]
     }
pd.DataFrame(dict_value)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# DateFrame is table ,a table has rows and columns
# series is list or one dimensional array

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [18]:
dict_value={"name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]
     }
data=pd.DataFrame(dict_value)
data

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
data.head(1) 
# first records

    name  Age  Gender
0  Alice   25  Female

In [23]:
data.tail(1) 
# last records

     name  Age  Gender
2  Claire   27  Female

In [25]:
data.dtypes
# data types of given data frame

name      object
Age        int64
Gender    object
dtype: object

In [27]:
data.columns
# get all columns name only

Index(['name', 'Age', 'Gender'], dtype='object')

In [31]:
data["name"]
# name column only

0     Alice
1       Bob
2    Claire
Name: name, dtype: object

In [34]:
data[["name","Age"]]
# retrive multiple column

     name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [40]:
# get age greater than 25 and name of person only
data[data["Age"] >25]["name"]

1       Bob
2    Claire
Name: name, dtype: object

In [42]:
data.describe()
# used to describe data

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [58]:
dict_value2={"name":["Alice","Bob","Claire","Alice","Bob","Claire","Alice","Bob","Claire","shan","check","check"],
      "Age":[1,2,3,4,5,6,7,8,9,10,11,12]
      
     }

In [59]:
dict_value2=pd.DataFrame(dict_value2)

In [60]:
dict_value2.describe()

             Age
count  12.000000
mean    6.500000
std     3.605551
min     1.000000
25%     3.750000
50%     6.500000
75%     9.250000
max    12.000000

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrames are both value-mutable and size-mutable (Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed).


ex.In data frame we can delete row  and we can change any column value in any row
but in series we can only change value but not length

# Create a DataFrame using multiple Series. Explain with an example.

In [61]:
#Importing Pandas library
import pandas as pd

#Creating two lists
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
#Creating two Series by passing lists
auth_series = pd.Series(author)
article_series = pd.Series(article)
#Creating a dictionary by passing Series objects as values
frame = { 'Author': auth_series, 'Article': article_series }
#Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)
#Printing elements of Dataframe
print(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178